[{"name":"Aloo Paratha","type":"Breakfast","steps":"Knead wheat flour like chapatti dough. Mix all the ingredients. Put the filling in a rolled out paratha, close the ends and roll again. Roast it on tawa with little ghee/butter. Serve hot with yoghurt (mixed with kala namak and chilli powder), pickle and papad.","ingredients":" 2 cups Wheat flour, 3-4 Potatoes (boiled, grated and mashed), 1 tsp Garam masala, 2 tsp Red chilli powder, 2 tsp Dhania (jeera) powder, ½ tsp Amchur powder, Fresh finely chopped coriander, Bread crumbs","imageurl":"http://www.ndtv.com/cooks/images/aloo-paratha-vrat-niru_med.jpg","date":"11/4/2015"},{"name":"Pancake","type":"Breakfast","steps":"Mix flour, salt, egg, oil and enough milk to form a smooth paste. Add the rest of the milk and some water to make a batter that falls smoothly off the spoon in a thick stream. Let it rest for 15 minutes. Put a heavy based frying pan over high heat and add one Tbsp of oil. Once the oil is hot lower the heat, turn the oil around in the pan, and drain off the excess oil leaving the pan only brushed with oil. Turn up the heat again, and pour enough batter for 1 pancake in the pan and spread it out. Lower the heat, cook on one side till light brown, then turn over and brown the other side. And serve.","ingredients":"1/2 cup maida, 1 egg, 1/4 cup milk, Water as required, 1/4 tsp salt, 1 tsp oil, 2 Tbsp oil for cooking the pancakes ","imageurl":"http://www.ndtv.com/cooks/images/pancakes_med.jpg","date":"11/3/2015"},{"name":"Crock Pot Roast","type":"Dinner Party","steps":"Place chicken roast in crock pot. Mix the dried mixes together in a bowl and sprinkle over the roast. Pour the water around the roast. Cook on low for 7-9 hours.","ingredients":"1 Chicken roast, 1 package brown gravy mix, 1 package dried Italian salad dressing mix, 1 package dry ranch dressing mix, 1/2 cup water","imageurl":"http://img.sndimg.com/food/image/upload/w_266/v1/img/recipes/27/20/8/picVfzLZo.jpg","date":"11/2/2015"},{"name":"Pizza","type":"Dinner Party","steps":"Add hot water to yeast in a large bowl and let sit for 15 minutes.Mix in oil, sugar, salt, and flour and let sit for 1 hour.Knead the dough and spread onto a pan.Spread pizza sauce and sprinkle cheese.  Add any optional toppings as you wish. Bake at 400 deg Fahrenheit for 15 minutes.Enjoy!","ingredients":"5 teaspoons yeast, 5 cups flour, 4 tablespoons vegetable oil, 2 tablespoons sugar, 2 teaspoons salt, 2 cups hot water, 1/4 cup pizza sauce, 3/4 cup mozzarella cheese","imageurl":"http://www.ndtv.com/cooks/images/Pepparon-Pizza_med.jpg","date":"11/2/2015"},{"name":"Grilled Potato Kebabs","type":"Snacks","steps":"Prepare the popcorn in a micro wave. When done, transfer it into a bowl. Mix the cracked black pepper, lemon zest, salt, amchoor powder together. Then add to the popcorn and toss well in a bowl. Drizzle with a splash of lemon juice. Garnish it with some chopped coriander leaves and serve hot.","ingredients":"1 packet butter flavor popcorn, 1 tsp cracked black pepper, 1 tsp lemon zest, 1 tsp amchoor powder, 1 tsp lemon juice","imageurl":"http://www.ndtv.com/cooks/images/lemon-popcorn_med.jpg","date":"10/3/2015"},{"name":"Samosas","type":"Snacks","steps":"Mix the refined flour, salt and oil. Add water and knead into a firm but pliable dough. Make into 8-10 smooth balls. Roll into thin rounds, about 15cm/6 in diameter, and cut into halves. Take one half, wet the edges, and fold the straight edge at the center to bring the two halves together, overlapping a bit to form into a triangular case. Press the overlapping portion, and fill the case with the filling, leaving a margin of 1cm/ 1/2 inch all around. Press the edges together to seal the samosas. Fill all the pieces in the same manner, keeping them covered with a damp cloth. Heat oil till a piece of dough thrown in, comes up immediately. Add as many samosas as come in without touching each other. Lower the heat to medium. Fry to a golden brown on either side. Serve hot, with a chutney","ingredients":"2 cups refined flour-sifted, 1 tsp salt, 2 Tbsp oil, Cold water to knead,Filling of your choice (keema, potatoes etc), Oil for deep frying","imageurl":"http://www.ndtv.com/cooks/images/samosa_holi_med.jpg","date":"10/4/2015"},{"name":"Pina Colada","type":"Drinks","steps":"Put all the ingredients in a blender. Blend it well. Serve in Tabu Tikki glass with ice cubes (5-6). Garnish with fresh pineapple, orange and maraschino cherry","ingredients":"30ml Malibu rum, 30ml white rum, 60 ml fresh coconut water, 30ml sugar syrup, 60ml pineapple juice, 20gm coconut cream, Pineapple, orange and maraschino cherry for garnishing","imageurl":"http://www.ndtv.com/cooks/images/pina-colada_330.jpg","date":"10/6/2015"},{"name":"Mud Slide","type":"Drinks","steps":"Add all the ingredients in a cocktail shaker along with some ice cubes. Shake well and fill up in an old fashioned glass. You can also top it with some whipped cream and chocolate sauce or shavings.","ingredients":"15 ml Kahlua, 15ml Absolut vodka, 30 ml Irish Creme","imageurl":"http://www.ndtv.com/cooks/images/iStock_000063992525_Small%20%282%29.jpg","date":"10/8/2015"},{"name":"Chocolate cake","type":"Desserts","steps":"Preheat the oven at 100 degree C. Break the compound chocolate into smaller chunks and melt them in a double boiler. Keep it aside and let it cool completely. In a mixing bowl, whisk the eggs till light and fluffy. Add the sugar, a teaspoon at a time, and continue whisking until well combined. Combine the melted chocolate with melted butter and mix well. Pour this into the egg and sugar mixture, and whisk well. Sift together the ragi flour and baking powder. Add it, a teaspoon at a time to the above mixture while you continue folding. Ensure that no lumps are left behind but do not over mix. Pour in the whisky and give it a final fold, and transfer to a small baking tin (6 inch diameter). Bake in the oven at 150 degree C for 15 minutes or until a skewer inserted at the centre of the tin comes out clean. Remove from the oven and let it cool a little before demoulding onto a plate.","ingredients":"100 gm compound dark chocolate, 2 eggs, 1/2 cup castor sugar or brown sugar, 1/2 cup melted butter, 1/2 cup ragi flour, 1/2 tsp baking powder,2 Tbsp, Whisky","imageurl":"http://www.ndtv.com/cooks/images/iStock_000052723726_Small%20%282%29.jpg","date":"10/9/2015"},{"name":"Apple Fritters","type":"Desserts","steps":"Blend the flour, milk and salt to make a smooth batter. Peel, core and slice the apples into 1/4 inch (1 mm) thick slices.Dip the apple slices into the batter and deep-fry them at 375 °F (190 °C) for 2 to 3 minutes until lightly browned on both sides. Sprinkle with sugar whilst hot and serve immediately.","ingredients":"4 cups all purpose flour, 750 m milk, 1/4 tsp salt, 6 apples, 8 cups canola oil for deep-frying, granulated sugar","imageurl":"http://www.ndtv.com/cooks/images/Apple_Fritters_2015%20%281%29.jpg","date":"11/4/2015"},{"name":"Chilli Prawns","type":"Seafood","steps":"Soak dry red chillies in boiling water for 10 minutes. Grind together these soaked red chillies along with garlic, coriander, cumin shahi jeera and salt. Add olive oil to this paste & mix well. Marinate prawns with this paste and leave aside for at least 20 minutes. Heat a grill pan. Add 1 Tbsp. olive oil. Fry the marinated prawns.Garnish with fresh coriander leaves and serve.","ingredients":"8-10 Prawns, 10-12 dry red chillies, 4-5 Garlic cloves, 1 tsp Coriander seeds, 1 tsp Cumin, 1 tsp Shahijeera, 50 ml Olive oil, 1 Lemon, Salt to taste","imageurl":"http://www.ndtv.com/cooks/images/prawnsnew-330.jpg","date":"11/7/2015"},{"name":"Fish Fingers","type":"Seafood","steps":"Marinate the fish with lemon juice, worcestershire, salt and pepper for about 15 minutes. Roll in flour and dip in the egg white and finally in the popcorn, bread crumb mixture. Bake or deep fry in hot oil.","ingredients":"250 gm fish cut into fingers, 1 lemon, juice, 1 tsp Worcestershire sauce, Salt to taste, Pepper to taste, 1 cup flour, 2 egg, white, 1/2 cup bread crumbs","imageurl":"http://www.ndtv.com/cooks/images/popcorn-fish-fingers_med.jpg","date":"11/5/2015"},{"name":"Chocolate Cookie Sandwiches","type":"Desserts","steps":"In a microwave or a heavy saucepan set over low heat, melt chocolate. Then allow it to cool. In a large bowl, combine sugar, canola oil, milk, vanilla, eggs and melted chocolate. Beat well. Sift together flour and baking powder and add to chocolate mixture. Mix well. Cover and chill for 1-2 hours or until dough is easy to handle. Preheat oven to 375 °F (190 °C). Shape dough into 1 inch balls. Place 2 inches. Bake for 10 to 12 minutes or until tops are lightly browned. Remove and cool on wire rack. To prepare filling: In bowl, mix together cream cheese, canola margarine, vanilla and icing sugar. Beat until mixture is smooth and well combined. Place filling in between two cookies.","ingredients":"4 squares semi-sweet chocolate, 1 1/2 cups granulated sugar, 3 Tbsp or 45ml canola oil, 2 Tbsp or 30 ml milk, 2 tsp or 10 ml of vanilla, 3 eggs, 2 cups all purpose flour,  2 tsp baking powder, 125 gm cream cheese , 1/4 cup or 60 ml non-hydrogenated canola margarine , 1 tsp or 5 ml of vanilla, 2 cups icing sugar","imageurl":"http://www.ndtv.com/cooks/images/chocolate-cookie-sandwiches-002_330.jpg","date":"11/5/2015"},{"name":"Molten Chocolate Cake","type":"Desserts","steps":"In a double boiler, add water to the bottom pot and add canola oil and chocolate to the top pot. Bring water in the bottom pot to a boil. Turn heat to low and stir the oil-chocolate mixture for about 4 minutes,until the chocolate is melted and the mixture is smooth. Make sure the water does not boil again. In a bowl, whisk whole eggs, egg yolks and sugars together until well blended. Whisk the chocolate mixture into the egg mixture until thoroughly incorporated. Add all-purpose flour and almond flour into the chocolate mixture and whisk until just combined. Fold in cacao nibs. Brush 10 small ramekins with canola oil and scoop about 6 Tbsp (90 mL) of cake batter into each ramekin. You may place filled ramekins in refrigerator or freezer for later baking but bring to room temperature before proceeding with the next step. Preheat the oven to 350 °F (180 °C). Bake for 10 minutes. Remove the ramekins from the oven and unmold each of them directly onto a plate. Serve warm with fresh berries and Star Anise- and Orange-Infused Canola Ice Cream.","ingredients":"250 ml canola oil, 325g Dark chocolate, 7 eggs, 6 egg yolks, 2/3 cup granulated sugar, 2 Tbsp light brown sugar , 1/2 cup all-purpose flour , 1/2 cup almond flour , 1/4 cup cacao nibs, finely chopped or mini chocolate chips ","imageurl":"http://www.ndtv.com/cooks/images/CIA_._Chocolate_Almond_Molten_Cake_._2014.jpg","date":"11/5/2015"},{"name":"Apple And Walnut Salad","type":"Breakfast","steps":"Cut Washington apples into wedges. Heat a pan on low flame, add apples, 2-3 tbsp. balsamic vinegar and 2-3 tbsp. caster sugar. Cook till apples absorb vinegar and sugar, leave aside to cool. Caramelize caster sugar, add walnuts, leave it to cool . Now, in a bowl add 2-3 tbsp. balsamic vinegar and chopped basil leaves. To this, add salt, pepper and olive oil. Whisk and add 1/2 tbsp. curry powder. Finish by crushing caramelized walnuts atop. Serve on a bed of lettuce.\r\n","ingredients":"3-4 Washington apples, Bowlful of walnuts, 15-20 Basil leaves, Lettuce, 4-5 cups of caster sugar, Black pepper, Curry powder, Balsamic vinegar, Olive oil","imageurl":"http://www.ndtv.com/cooks/images/walnutsalad.jpg","date":"11/5/2015"}]